{
  "format": "layers-model",
  "generatedBy": "AeroGrowthSquad",
  "convertedBy": "Manual Creation",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "plant_health_model",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              224,
              224,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          }
        }
      ]
    }
  },
  "weightsManifest": []
}