{
  "format": "layers-model",
  "generatedBy": "keras v2.12.0",
  "convertedBy": "TensorFlow.js Converter v4.0.0",
  "modelTopology": {
    "keras_version": "2.12.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "plant_health_classifier",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "predictions",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "predictions/kernel",
          "shape": [150528, 1],
          "dtype": "float32"
        },
        {
          "name": "predictions/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
}